# GetSectionData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleTemplate..::..GetSectionData Method
PanelScheduleTemplate Class See Also
---
Gets the writable section data object.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TableSectionData GetSectionData(
	SectionType sectionType
)
```

Visual Basic
---
```text
Public Function GetSectionData ( _
	sectionType As SectionType _
) As TableSectionData
```

Visual C++
---
```text
public:
TableSectionData^ GetSectionData(
	SectionType sectionType
)
```

# ### Parameters
sectionType
    Type: Autodesk.Revit.DB..::..SectionType
# ### Return Value
The table section data object.
# Remarks
Access to this information requires an open transaction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace